c5n/oh-ez-touch/sdkconfig.defaults.esp32
# ESP32 device settings.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# LV_DEF_REFR_PERIOD is 30 ms, so a 100 Hz tick (the IDF default) quantises the
# refresh badly.
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# -Os. The PlatformIO build was -O0 across LVGL, TFT_eSPI, the Arduino
# libraries and the application -- about 400 KB of text compiled with no
# optimisation at all, against prebuilt ESP-IDF archives that were already
# -Os. See the README for what it actually saved.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# The XPT2046 driver's own conversion is a full-scale map with no offset, which
# cannot express this panel's calibration -- see main/port/esp32/port_indev.c.
# port_indev supplies a process_coordinates callback instead.
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=n
